[
  "Sorry, eh, I’d love to help but my toque’s on backwards and I’m all disoriented.",
  "Sorry, I just promised my neighbour I’d help him chase a moose out of his yard.",
  "Sorry, bud, I’m knee-deep in maple syrup right now.",
  "Oh shoot, sorry, I’ve got a thing with a beaver this afternoon.",
  "Sorry, I’d say yes but then I’d have to apologize again later, eh?",
  "Can’t right now, sorry. Hockey’s on.",
  "Sorry, eh—already committed to a poutine tasting.",
  "Sorry, but I’ve only got enough energy to be passive-aggressive today.",
  "Oh sorry, that sounds like a great idea... for someone else.",
  "Ope—sorry, just remembered I’m allergic to responsibility.",
  "Sorry, pal, the moose union’s on strike and so am I.",
  "Sorry, eh, but I can’t say yes when the Leafs might lose tonight.",
  "Sorry, I’d love to, but my snowshoes are in the shop.",
  "Sorry, but I’ve got to butter my crumpets and apologize to them.",
  "Sorry—Timmy’s run took longer than expected.",
  "Oh gosh, sorry, I’d rather not and that’s the most Canadian thing I can say.",
  "Sorry, but I’m saving my \"yes\" for something more maple-y.",
  "Sorry, I’m busy trying to politely ghost someone else.",
  "Sorry, I’m already overbooked with politeness.",
  "Oh no, sorry—I promised my grandma I’d help her alphabetize her molasses jars.",
  "Sorry, but my Mountie instincts say \"nay, eh.\"",
  "Sorry, I’m in a committed relationship with staying in.",
  "Sorry, I’d love to disappoint you later instead.",
  "Sorry—can’t. Still emotionally recovering from that last “yes.”",
  "Sorry, I’d rather fight a goose in sandals.",
  "Sorry, my politeness quota is full this week.",
  "Sorry, bud, I’d say yes but then we’d both regret it.",
  "Sorry, eh, but my conscience said nope.",
  "Sorry, but I’m out of loonies and motivation.",
  "Sorry, the ferry to “Yes Island” is iced over.",
  "Sorry, can’t help—still embarrassed from last week.",
  "Sorry, I’m trying to say “no” more—politely of course.",
  "Sorry, but my politeness comes with boundaries now.",
  "Sorry, but my soul said “absolutely not” in French.",
  "Sorry, I’d say yes, but the geese advised against it.",
  "Sorry, I just stepped on my own feelings and need a moment.",
  "Sorry, but I can’t betray my inner introvert like that.",
  "Sorry, I’m too tired to be helpful today—again, so sorry.",
  "Sorry, it’s not you—it’s my tendency to overcommit then regret it.",
  "Sorry, bud, but that sounds like effort and I’m morally opposed to that.",
  "Sorry, I’ve got a curling match with destiny.",
  "Sorry, I gave up “yes” for Lent, even though I’m not religious.",
  "Sorry, eh—I’m on a strict “say no and hydrate” diet.",
  "Sorry, I’m emotionally booked until further notice.",
  "Sorry, but that sounds like a trap wrapped in friendship.",
  "Sorry, eh—I’m stuck in line at the drive-thru behind a guy ordering 37 Timbits.",
  "Sorry, but my goose told me not to.",
  "Sorry, eh—I just don’t think the world’s ready for that kind of chaos.",
  "Sorry, but I need to consult the Elders of Chill first.",
  "Sorry, the spirit of Gordon Lightfoot said “no.”",
  "Sorry, but I already promised my couch I wouldn’t leave it today.",
  "Sorry, I’d rather build a snow fort around my emotions.",
  "Sorry, but my vibe said no before you even asked.",
  "Sorry, I’m on a quest to disappoint fewer people, starting now.",
  "Sorry, eh, I’m avoiding obligations like I avoid polar bears.",
  "Sorry, I’m on a no-yes cleanse.",
  "Sorry, but my sorry is already overbooked.",
  "Sorry, my horoscope said to avoid all tasks.",
  "Sorry, I’ve used up my daily allowance of giving a hoot.",
  "Sorry, but I’ve already scheduled time to stare into the snow and contemplate.",
  "Sorry, can’t—I'm on Goose Watch Duty.",
  "Sorry, but my snowmobile’s in retrograde.",
  "Sorry, the universe sent me a “nah” in Morse code.",
  "Sorry, I’ve already RSVP’d “no” to everything today.",
  "Sorry, but my politeness doesn’t stretch that far.",
  "Sorry, I’m just trying to survive winter and that’s a full-time job.",
  "Sorry, my emotional support beaver said it’s a bad idea.",
  "Sorry, I’m hibernating from human interaction.",
  "Sorry, my therapist said I need to start saying “no” more—eh?",
  "Sorry, but I’m on a break from ambition.",
  "Sorry, but I already apologized for something else today.",
  "Sorry, but that would interrupt my existential crisis.",
  "Sorry, I’m preserving my energy for something pointlessly dramatic later.",
  "Sorry, but I’ve got a backlog of other regrets to get through first.",
  "Sorry, but I don’t want to ruin your day with my mediocrity.",
  "Sorry, I’m on strike from being overly agreeable.",
  "Sorry, the snow said stay home, and I listen to snow.",
  "Sorry, but I’m not emotionally prepared for that kind of commitment.",
  "Sorry, I’m attending a support group for people who agree too much.",
  "Sorry, but the last time I said yes, I ended up with 4 raccoons and a fine.",
  "Sorry, my flannel said no.",
  "Sorry, I’m all out of agreeable energy.",
  "Sorry, I’ve been booked for a full day of politely ignoring texts.",
  "Sorry, eh—my sincerity levels are dangerously low today.",
  "Sorry, the Northern Lights told me to chill.",
  "Sorry, my aura needs a rest.",
  "Sorry, but I’m emotionally constipated right now.",
  "Sorry, I’d help, but I’ve got to watch ice melt.",
  "Sorry, but I’ve been warned by every Canadian instinct I have.",
  "Sorry, I’m busy pretending to be productive.",
  "Sorry, but I’ve got to go pet a bear emotionally.",
  "Sorry, eh—just not feeling enough guilt today.",
  "Sorry, but I’m practicing radical passivity.",
  "Sorry, I’m saving that “yes” for something with maple syrup.",
  "Sorry, but my politeness is on cooldown.",
  "Sorry, I’m emotionally buffering—please stand by.",
  "Sorry, but my sense of obligation went south for the winter.",
  "Sorry, that sounds great, but I’d rather eat snow.",
  "Sorry, but I’m emotionally invested in saying no.",
  "Sorry, eh—but my heart says no, and my poutine agrees."
]
