[
  "Sorry, eh, I’d love to help but my toque’s on backwards and I’m all disoriented.",
  "Sorry, I just promised my neighbour I’d help him chase a moose out of his yard.",
  "Sorry, bud, I’m knee-deep in maple syrup right now.",
  "Oh shoot, sorry, I’ve got a thing with a beaver this afternoon.",
  "Sorry, I’d say yes but then I’d have to apologize again later, eh?",
  "Can’t right now, sorry. Hockey’s on.",
  "Sorry, eh—already committed to a poutine tasting.",
  "Sorry, but I’ve only got enough energy to be passive-aggressive today.",
  "Oh sorry, that sounds like a great idea... for someone else.",
  "Ope—sorry, just remembered I’m allergic to responsibility.",
  "Sorry, pal, the moose union’s on strike and so am I.",
  "Sorry, eh, but I can’t say yes when the Leafs might lose tonight.",
  "Sorry, I’d love to, but my snowshoes are in the shop.",
  "Sorry, but I’ve got to butter my crumpets and apologize to them.",
  "Sorry—Timmy’s run took longer than expected.",
  "Oh gosh, sorry, I’d rather not and that’s the most Canadian thing I can say.",
  "Sorry, but I’m saving my \"yes\" for something more maple-y.",
  "Sorry, I’m busy trying to politely ghost someone else.",
  "Sorry, I’m already overbooked with politeness.",
  "Oh no, sorry—I promised my grandma I’d help her alphabetize her molasses jars.",
  "Sorry, but my Mountie instincts say \"nay, eh.\"",
  "Sorry, I’m in a committed relationship with staying in.",
  "Sorry, I’d love to disappoint you later instead.",
  "Sorry—can’t. Still emotionally recovering from that last “yes.”",
  "Sorry, I’d rather fight a goose in sandals.",
  "Sorry, my politeness quota is full this week.",
  "Sorry, bud, I’d say yes but then we’d both regret it.",
  "Sorry, eh, but my conscience said nope.",
  "Sorry, but I’m out of loonies and motivation.",
  "Sorry, the ferry to “Yes Island” is iced over.",
  "Sorry, can’t help—still embarrassed from last week.",
  "Sorry, I’m trying to say “no” more—politely of course.",
  "Sorry, but my politeness comes with boundaries now.",
  "Sorry, but my soul said “absolutely not” in French.",
  "Sorry, I’d say yes, but the geese advised against it.",
  "Sorry, I just stepped on my own feelings and need a moment.",
  "Sorry, but I can’t betray my inner introvert like that.",
  "Sorry, I’m too tired to be helpful today—again, so sorry.",
  "Sorry, it’s not you—it’s my tendency to overcommit then regret it.",
  "Sorry, bud, but that sounds like effort and I’m morally opposed to that.",
  "Sorry, I’ve got a curling match with destiny.",
  "Sorry, I gave up “yes” for Lent, even though I’m not religious.",
  "Sorry, eh—I’m on a strict “say no and hydrate” diet.",
  "Sorry, I’m emotionally booked until further notice.",
  "Sorry, but that sounds like a trap wrapped in friendship.",
  "Sorry, eh—I’m stuck in line at the drive-thru behind a guy ordering 37 Timbits.",
  "Sorry, but my goose told me not to.",
  "Sorry, eh—I just don’t think the world’s ready for that kind of chaos.",
  "Sorry, but I need to consult the Elders of Chill first.",
  "Sorry, the spirit of Gordon Lightfoot said “no.”",
  "Sorry, but I already promised my couch I wouldn’t leave it today.",
  "Sorry, I’d rather build a snow fort around my emotions.",
  "Sorry, but my vibe said no before you even asked.",
  "Sorry, I’m on a quest to disappoint fewer people, starting now.",
  "Sorry, eh, I’m avoiding obligations like I avoid polar bears.",
  "Sorry, I’m on a no-yes cleanse.",
  "Sorry, but my sorry is already overbooked.",
  "Sorry, my horoscope said to avoid all tasks.",
  "Sorry, I’ve used up my daily allowance of giving a hoot.",
  "Sorry, but I’ve already scheduled time to stare into the snow and contemplate.",
  "Sorry, can’t—I'm on Goose Watch Duty.",
  "Sorry, but my snowmobile’s in retrograde.",
  "Sorry, the universe sent me a “nah” in Morse code.",
  "Sorry, I’ve already RSVP’d “no” to everything today.",
  "Sorry, but my politeness doesn’t stretch that far.",
  "Sorry, I’m just trying to survive winter and that’s a full-time job.",
  "Sorry, my emotional support beaver said it’s a bad idea.",
  "Sorry, I’m hibernating from human interaction.",
  "Sorry, my therapist said I need to start saying “no” more—eh?",
  "Sorry, but I’m on a break from ambition.",
  "Sorry, but I already apologized for something else today.",
  "Sorry, but that would interrupt my existential crisis.",
  "Sorry, I’m preserving my energy for something pointlessly dramatic later.",
  "Sorry, but I’ve got a backlog of other regrets to get through first.",
  "Sorry, but I don’t want to ruin your day with my mediocrity.",
  "Sorry, I’m on strike from being overly agreeable.",
  "Sorry, the snow said stay home, and I listen to snow.",
  "Sorry, but I’m not emotionally prepared for that kind of commitment.",
  "Sorry, I’m attending a support group for people who agree too much.",
  "Sorry, but the last time I said yes, I ended up with 4 raccoons and a fine.",
  "Sorry, my flannel said no.",
  "Sorry, I’m all out of agreeable energy.",
  "Sorry, I’ve been booked for a full day of politely ignoring texts.",
  "Sorry, eh—my sincerity levels are dangerously low today.",
  "Sorry, the Northern Lights told me to chill.",
  "Sorry, my aura needs a rest.",
  "Sorry, but I’m emotionally constipated right now.",
  "Sorry, I’d help, but I’ve got to watch ice melt.",
  "Sorry, but I’ve been warned by every Canadian instinct I have.",
  "Sorry, I’m busy pretending to be productive.",
  "Sorry, but I’ve got to go pet a bear emotionally.",
  "Sorry, eh—just not feeling enough guilt today.",
  "Sorry, but I’m practicing radical passivity.",
  "Sorry, I’m saving that “yes” for something with maple syrup.",
  "Sorry, but my politeness is on cooldown.",
  "Sorry, I’m emotionally buffering—please stand by.",
  "Sorry, but my sense of obligation went south for the winter.",
  "Sorry, that sounds great, but I’d rather eat snow.",
  "Sorry, but I’m emotionally invested in saying no.",
  "Sorry, eh—but my heart says no, and my poutine agrees.",
  "Sorry b’y, I’d help, but I’ve got a hockey game and a broken skate lace.",
  "Oh no, sorry eh—I’m out like a moose at moose o’clock.",
  "I’d say yes, but my Timbit just fell in my double-double and that’s my priority now, sorry!",
  "Sorry, can’t do it—there’s a goose giving me the stink-eye outside.",
  "I'd love to help, but my toque's frozen to my head, b’y.",
  "Sorry, I’m busy yelling at the Leafs again.",
  "Oh, that’s a hard no, like Winnipeg in January.",
  "I'd agree, but my snowblower just quit and so did I, eh?",
  "Sorry eh, I’m booked solid until the snow melts—so, like, never.",
  "I’d say yes, but then I’d have to explain it to the moose in my garage.",
  "Sorry b’y, can’t—my canoe's frozen in place.",
  "No can do—I've already committed to watching curling for the next six hours.",
  "Oh, sorry! But I promised my neighbour I’d shovel their driveway, and their neighbour’s, and—",
  "I'd help, but the geese union says I’m on strike.",
  "Sorry, the weather app says \"no\", and I trust it more than I trust myself.",
  "I’m sorry, but my hands are full of ketchup chips and maple syrup.",
  "Eh, I would—but that’s above my paygrade and below freezing.",
  "Sorry b’y, it’s a no from me and also from the whole village.",
  "Oh, I’d totally help—if I hadn’t just gotten stuck in a snowbank with no cell service.",
  "Nah, sorry, I’m saving my energy for ice fishing season.",
  "Sorry eh, can’t do that—it goes against my code of polite refusal.",
  "I’d love to say yes, but I value my sanity and this toque too much.",
  "Sorry, I just started watching a 7-part CBC doc about geese psychology.",
  "Can’t. I’m booked solid with Tim Hortons runs and weather complaints.",
  "Sorry b’y, the local moose council advised against it.",
  "My apologies—I’ve got a family maple syrup boil to attend.",
  "I'd be on board, but my emotional support raccoon says otherwise.",
  "Nope. Sorry. Too much black ice in my life already.",
  "I’d say yes, but I need to reorganize my flannel by colour.",
  "Sorry eh, that sounds like something for Future Me, and he’s out ice fishing.",
  "Sorry b’y, I’ve got a bad case of the Januarys.",
  "Eh, I can’t. It’s against the rules in the Tim Hortons bylaws.",
  "Sorry, I can’t—my toque’s stuck in customs.",
  "I’d say yes, but I promised my dog we’d binge hockey replays.",
  "Apologies, I’m caught in a passive-aggressive loop with my neighbour again.",
  "Sorry, I can’t commit to anything before the next snowfall.",
  "I’m in the penalty box of life right now, eh?",
  "Sorry b’y, I ran out of emotional maple syrup.",
  "Can’t. I’m busy apologizing for something I didn’t do again.",
  "Sorry, I’m on a national “say no nicely” tour.",
  "Nope. Sorry. The snowdrift outside says \"not today.\"",
  "I'd help, but I just put on my indoor socks.",
  "Sorry eh, I already RSVP’d to disappointment.",
  "I would, but I promised not to overcommit until the geese calm down.",
  "Sorry, I’m training for competitive apologizing.",
  "I’m on a 3-day poutine cleanse—no energy left, b’y.",
  "Sorry, my therapist says I need to set boundaries like a true Canadian.",
  "Oh no b’y, I’m still recovering from a curling injury.",
  "Sorry, this request doesn’t align with my seasonal affective disorder schedule.",
  "I would, but I’m emotionally unavailable due to frostbite.",
  "Sorry eh, I just started reorganizing my hockey cards—could take a while.",
  "I’d help, but my snow tires are on strike.",
  "Sorry, but I’m neck-deep in snow and emotional repression.",
  "I’d love to, but the Mounties said no—and who am I to argue?",
  "Can’t commit right now, I’m busy chasing off a goose from my porch.",
  "Sorry, my emotional bandwidth is full of frost warnings.",
  "Oh no b’y, that sounds like a next-winter kind of task.",
  "I would, but I just got comfortable under six blankets and a cat.",
  "Eh, my horoscope said “stay cozy, avoid confrontation.”",
  "Sorry b’y, I’ve hit my monthly quota of doing things.",
  "I’d love to say yes, but that would be dishonest—and I’m not that kind of Canadian.",
  "I can’t, I promised my cousin I’d hold their spot in the Timmies drive-thru.",
  "Sorry, the vibes are too slushy for that today.",
  "My therapist (who is a very wise beaver) advised against it.",
  "Sorry, I just started a serious relationship with my electric blanket.",
  "No can do, I’m on geese patrol all weekend.",
  "Eh, I’d say yes, but my snow globe says \"maybe next time.\"",
  "Sorry, I’ve entered full winter denial mode.",
  "Can’t—there’s a Tim Hortons cup shortage and I’m emotionally spiralling.",
  "I’ve already over-apologized today and need to recharge, b’y.",
  "I’d say yes, but I’ve got a conflict with a family of raccoons in my attic.",
  "Sorry, the local weather report said \"Nope\" and I believe it.",
  "I would, but I’ve got six layers of flannel to fold.",
  "Sorry b’y, I’m spiritually snowed in.",
  "Eh, I can’t help right now—I’m nurturing my indoor plants with hockey commentary.",
  "No, sorry—my brain’s frozen and rebooting on dial-up.",
  "I tried saying yes, but the snowdrift outside hissed at me.",
  "Sorry, I’m avoiding stress until after the next thaw.",
  "Oh no b’y, I’ve got to cancel—I’m emotionally exhausted from small talk.",
  "I'd help, but I’ve already RSVP’d to my couch.",
  "Sorry eh, I’d commit but I’ve already promised to watch snow melt.",
  "Can’t do it—my flannel’s at the cleaners and I’m emotionally exposed.",
  "I’d help, but I’m deep in a butter tart existential crisis.",
  "Sorry b’y, it’s not you—it’s me, and also the geese.",
  "I’m booked solid—two hockey games and a passive-aggressive potluck.",
  "Oh, I’d say yes, but then I’d have to explain it to my moose therapist.",
  "I can’t, I’ve got a maple syrup emergency on aisle four.",
  "Sorry, but my ice skates are tangled in life choices.",
  "I’d love to, but I’m currently avoiding confrontation and eye contact.",
  "No b’y, I just bought new mittens and I’m not risking them.",
  "Sorry, but my coffee-to-sanity ratio is too low right now.",
  "I'd do it, but I'm already emotionally committed to staying in.",
  "Can’t—my apologies queue is full and buffering.",
  "Sorry eh, I promised not to make decisions during chinook season.",
  "I’m on the fence, and it’s icy, so I’m not moving.",
  "Nope, I’m on a “no” cleanse. It’s doctor-recommended and flannel-approved.",
  "I’d love to help, but my beaver spirit guide said “absolutely not.”",
  "Sorry, I’m in the middle of a maple syrup fermentation workshop.",
  "I can’t, I’ve got a long-standing rivalry with my thermostat.",
  "Oh b’y, I said yes once last month and I’m still apologizing for it.",
  "Sorry, I’m still grieving the Leafs’ playoff run.",
  "Eh, I’d say yes, but I’ve already over-apologized for January.",
  "I can’t—my soul is stuck in a snow drift.",
  "Sorry b’y, that sounds like emotional labour and I’m in hibernation.",
  "I would, but my inner goose says “honk off.”",
  "Nah, I’m reserving my energy for dramatic snowfall overreactions.",
  "Sorry, I’ve got a maple leaf festival and a mild existential crisis.",
  "I'd say yes, but my igloo sprung a leak and now I’ve got wet feelings.",
  "I’d agree, but I’m avoiding commitments until the frostbite goes away.",
  "Sorry eh, my inner Newfoundlander says “nope b’y.”",
  "Oh no, I’ve just entered full toque-and-denial mode.",
  "Sorry b’y, I’m marinating in Canadian guilt already—no more room!",
  "I’d help, but it’s snowing in my heart and I need a double-double.",
  "Can’t. I’ve got a polite disagreement scheduled at 3:00.",
  "Sorry eh, but that request is more slippery than a black ice patch.",
  "I’d love to, but my emotional weather says 80% chance of nope.",
  "Sorry b’y, I’m down to my last pair of dry socks—can’t risk it.",
  "No can do—I’m on a flannel retreat.",
  "I would, but my commitment quota is stuck in customs.",
  "Eh, sorry—I’m trying not to say “yes” unless it involves poutine.",
  "Sorry eh, I’ve got a standing appointment with a moody goose.",
  "I’d say yes, but I’m emotionally snowed in till spring thaw.",
  "No can do—I’m on a strict “no social risk” diet.",
  "Sorry b’y, I promised my Nana I’d rest my overthinking muscle.",
  "I’m flattered, but I’ve got a loonie stuck in my decision engine.",
  "I would, but it interferes with my weekly denial nap.",
  "Sorry eh, I already said “maybe” to someone else today.",
  "I’d help, but the Wi-Fi’s out and so is my willpower.",
  "Can’t do it—I'm preserving my polite refusal stamina.",
  "Sorry, I’m saving my last “yes” for a surprise snow day.",
  "Eh, I’m in a long-term relationship with indecision.",
  "I’d love to, but my horoscope says “stay under a blanket.”",
  "Sorry b’y, I’m too busy wrestling with my feelings and a bag of ketchup chips.",
  "No thanks—I’m emotionally unavailable and physically wrapped in fleece.",
  "I can’t—my mental snow tires aren’t on yet.",
  "Sorry eh, I already maxed out my weekly “doing things” quota.",
  "I’d agree, but my conscience is currently binge-watching Schitt’s Creek.",
  "I’m in a delicate state of passive resistance, b’y.",
  "Sorry, I’ve got plans to sit still and ponder weather.",
  "No b’y, that request sounds riskier than backyard ice rinks in April.",
  "I’m in the middle of a deep spiritual talk with a Timbit.",
  "Sorry eh, I’ve got a complicated relationship with ambition.",
  "Can’t say yes—it would confuse my therapist and my cat.",
  "I’d help, but I’ve just begun a personal journey called “Not Today.”",
  "Sorry b’y, my brain is at 60% slush right now.",
  "Nope. My psychic said this week is a firm “no week.”",
  "I’d commit, but I’ve already broken up with productivity.",
  "Sorry, I’ve enrolled in a night class called How To Say No Politely.",
  "I can’t—I’ve declared today a national holiday of avoidance.",
  "Eh, I’d love to, but I’ve got maple syrup simmering and an alibi brewing.",
  "I’m in the emotional equivalent of a late-April snowstorm.",
  "Sorry eh, I’m honour-bound to avoid all expectations.",
  "I would, but I just settled into my existential snow fort.",
  "I’m out, b’y. I’ve got ice in my inbox and no plow in sight.",
  "Sorry, I’ve hit my quota for pretending I’m okay.",
  "Can’t. I’m at war with my alarm clock and losing.",
  "Eh b’y, I’m flaking harder than fresh powder on a ski hill.",
  "Sorry, my life’s a soap opera starring me and a disgruntled raccoon.",
  "I'd say yes, but I fear the emotional whiplash.",
  "Can’t—my soul needs to defrost.",
  "My bad, eh—I meant to say yes, but then a goose locked me outta my truck.",
  "Sorry ‘bout dat, eh—was gonna show up, but I slipped on my own driveway three times.",
  "Can’t help, my bad—Tim Hortons gave me the wrong order and now I’m in mourning.",
  "Sorry ‘bout dat, eh—there’s a moose on my porch again and I value my kneecaps.",
  "My bad, b’y—I started shovelling snow this morning and just finished now.",
  "Sorry, eh—was halfway to sayin’ yes, then realized I’d left my mitts in Moose Jaw.",
  "My bad, eh—I’ve got a toque emergency. It shrank in the dryer and now it’s a chinstrap.",
  "Sorry ‘bout dat, b’y—lost track of time counting my Air Miles.",
  "My bad, eh—I’d love to help, but there’s a bear using my canoe.",
  "Sorry, b’y—was all set to join until a squirrel stole my Wi-Fi antenna.",
  "My bad, eh—I’m trapped in a group chat about snow tires.",
  "Sorry ‘bout dat—can’t commit, I’ve got a frozen lasagna and a broken microwave.",
  "My bad, b’y—tried to say yes, but autocorrect changed it to “Sorry, not today.”",
  "Sorry ‘bout dat, eh—my recycling bin just blew into the next province.",
  "My bad, eh—I got stuck listening to a stranger’s 12-minute Tim Hortons order.",
  "Sorry, b’y—I was ready to help, then my ice scraper snapped in half.",
  "My bad, eh—there was a maple syrup spill in the kitchen and now everything’s sticky.",
  "Sorry ‘bout dat, b’y—my curling match went into overtime.",
  "My bad, eh—I was emotionally prepared but physically stuck in traffic behind a Zamboni.",
  "Sorry, eh—tried to RSVP but hit a patch of black ice and slid into apathy.",
  "My bad, b’y—planned on pitching in, then the Northern Lights distracted me.",
  "Sorry ‘bout dat, eh—I’ve got snowblower envy and I need to work through it.",
  "My bad, eh—I’ve been in line at Canadian Tire since Tuesday.",
  "Sorry, b’y—there’s a moose in my garage and it’s unionized.",
  "My bad, eh—I over-apologized this week and now I’m on vocal rest.",
  "Sorry ‘bout dat—my GPS told me to turn left into a snowbank and I listened.",
  "My bad, eh—my poutine delivery came late and now I’m spiritually full.",
  "Sorry b’y—got my hand stuck in a Nanaimo bar tin, long story.",
  "My bad, eh—I said yes to something last week and I’m still recovering.",
  "Sorry ‘bout dat, eh—I forgot how to say “no” without explaining my life story.",
  "My bad, b’y—I’m emotionally snowed under and physically under a weighted blanket.",
  "Sorry, eh—my apologies are in maintenance mode this week.",
  "My bad, eh—I promised my Aunt Brenda I wouldn’t overextend myself past Winnipeg.",
  "Sorry ‘bout dat—got stuck holding the door open for 47 people, still there now.",
  "My bad, b’y—my parka zipper broke and I took it as a sign from the universe.",
  "Sorry, eh—I tried to help once, and now my chiropractor says no.",
  "My bad, eh—my local Tim’s is out of steeped tea and I can’t function like this.",
  "Sorry ‘bout dat, eh—just realized my yes was actually a very polite no.",
  "My bad, b’y—my furnace made a weird noise and I need to go stare at it.",
  "Sorry, eh—I’m conserving energy for next week’s snowstorm and emotional drama.",
  "My bad, eh—I left my decision-making skills in my other flannel.",
  "Sorry ‘bout dat, b’y—I was gonna say yes, but then I heard thunder snow and hid under the couch.",
  "My bad, eh—got caught in a heartfelt chat with a stranger at the LCBO.",
  "Sorry, b’y—I’ve hit my annual emotional bandwidth just from shovelling alone.",
  "My bad, eh—I slipped on a butter tart and saw my life flash before me.",
  "Sorry ‘bout dat—ran outta maple syrup and motivation at the same time.",
  "My bad, b’y—I agreed to something yesterday and I’m still apologizing for it.",
  "Sorry, eh—I got trapped in a Canadian standoff at a 4-way stop.",
  "My bad, eh—I’m emotionally buffering, please try again after next snowfall.",
  "Sorry ‘bout dat—my snowblower unionized and went on strike.",
  "My bad, b’y—I was too polite to decline sooner, so now I’m ghosting with guilt.",
  "Sorry, eh—I said “sure” out loud but meant “I’ll disappear quietly.”",
  "My bad, eh—I overextended myself trying to be helpful, now I’m lying in a nest of toques.",
  "Sorry ‘bout dat—got roped into a neighbour’s story about a fox and a deck chair.",
  "My bad, b’y—I’ve been emotionally compromised by playoff hockey.",
  "Sorry, eh—I’m not avoiding you, I’m just really into hiding behind politeness.",
  "My bad, eh—there was a surprise blizzard inside my freezer, and now I trust nothing.",
  "Sorry ‘bout dat—my brain’s running on winter tires and they’re not gripping well today.",
  "My bad, b’y—I missed your message ‘cause I was distracted by a goose giving me the stink-eye.",
  "Sorry, eh—I can’t say yes to anything unless it's served with gravy and cheese curds.",
  "My bad, eh—I’m working on saying no more often, but it’s still under construction like every road in Montreal.",
  "Sorry ‘bout dat—my therapist says I need boundaries, so this is one, eh?",
  "My bad, b’y—I meant to help, but my snow shovel broke and took my will to live with it.",
  "Sorry, eh—I’ve got too many tabs open—both in Chrome and in my brain.",
  "My bad, eh—lost my motivation somewhere between the third apology and the frozen lake.",
  "My bad, eh—I got distracted by a raccoon stealing my lunch in the backyard.",
  "Sorry ‘bout dat—there’s a moose blocking my driveway, and I’ve already apologized three times.",
  "My bad, b’y—I tried to say yes, but then a snowstorm hit and now I’m lost in my own house.",
  "Sorry, eh—I’d love to help, but my toque’s too tight and I can’t think straight.",
  "My bad, eh—I promised myself a “no” day, and I’m sticking to it, eh?",
  "Sorry ‘bout dat, b’y—I would, but my cat’s in charge of my schedule today.",
  "My bad, eh—I’m busy negotiating with the geese about winter travel plans.",
  "Sorry, eh—I tried to say yes, but I’m emotionally invested in my ice cream right now.",
  "My bad, b’y—I’ve been locked in a heated debate with my buddy about who’s got the better Timmy’s order.",
  "Sorry, eh—I said no before, but I’ve realized I’m not even sure what yes means anymore.",
  "My bad, eh—I’m taking a break from being overly helpful to focus on my inner peace.",
  "Sorry ‘bout dat, b’y—I’ve got a personal commitment with a hot cup of cocoa and a blanket fort.",
  "My bad, eh—I meant to say yes, but then I spilled maple syrup on my phone.",
  "Sorry, b’y—I’m recovering from an emotional breakdown about a snowplow blocking my street.",
  "My bad, eh—I can’t help, I’m too busy staring out the window wondering why I still live in this snow globe.",
  "Sorry ‘bout dat, eh—I’d do it, but I just got a Tim Hortons job application and need to prioritize my future.",
  "My bad, eh—I’m still processing my feelings about last season’s hockey playoffs.",
  "Sorry, eh—I can’t help, I’m in the middle of a very serious, very Canadian argument about poutine.",
  "My bad, b’y—I’ve got a to-do list that’s longer than a Quebec winter.",
  "Sorry, eh—I promised my mother I wouldn’t take on more than one request today.",
  "My bad, eh—I’m trying to respect my boundaries, which are currently made of snow and ice.",
  "Sorry ‘bout dat, b’y—I’m trying to work on my “no,” but it’s still in hibernation.",
  "My bad, eh—I was gonna agree, but then my housecoat wouldn’t cooperate.",
  "Sorry, b’y—I’ve reached my “niceness” limit for today, and I’m over budget.",
  "My bad, eh—I’m already booked—taking a nap with a cup of tea and a moose-themed blanket.",
  "Sorry, eh—I was gonna help, but my toque flew off in the wind, and I had to go chase it.",
  "My bad, eh—I’m in the middle of sorting out my collection of Tim Hortons cups.",
  "Sorry ‘bout dat, b’y—I can’t make it, my snowblower’s in the shop and I’m powerless.",
  "My bad, eh—I got caught in a very serious discussion about whether Timbits are actually donuts.",
  "Sorry, b’y—I was all set to say yes, but then I realized I still don’t understand how a Zamboni works.",
  "My bad, eh—I promised my pet moose I’d stay home and watch curling with him.",
  "Sorry ‘bout dat—just got lost in the grocery store trying to find the perfect maple syrup, eh.",
  "My bad, eh—I would, but my snowshoes are still in the car, and I’m not in the mood to find them.",
  "Sorry, b’y—there was a polar bear in my yard, and I couldn’t leave until I apologized first.",
  "My bad, eh—I’m too busy watching the weather report; we’re getting another snowstorm, eh.",
  "Sorry ‘bout dat—I was about to help, but I slipped on some frozen ice and now I’m stuck in a snowbank.",
  "My bad, eh—I’ve been binge-watching hockey and lost track of time.",
  "Sorry, b’y—I’d say yes, but my neighbour’s dog just barked at me, and I’m emotionally unavailable.",
  "My bad, eh—I accidentally put my phone in the freezer trying to cool down a hot drink.",
  "Sorry, eh—I’d love to, but there’s a moose standing on my front porch blocking the door.",
  "My bad, b’y—I’ve got a big stack of Tim Hortons cups to organize, and it’s a full-day job, eh.",
  "Sorry, eh—I was gonna help, but my favourite hockey team just scored, and now I’m emotionally invested.",
  "My bad, eh—my igloo’s collapsing and I gotta go fix it before the whole neighbourhood sees.",
  "Sorry, b’y—I’d love to, but I’ve got to go shovel my driveway for the fifth time today.",
  "My bad, eh—I promised to help, but I got distracted by a squirrel in my backyard who was also apologizing.",
  "Sorry ‘bout dat, eh—I got stuck behind a truck full of snowplows and couldn’t get here.",
  "My bad, b’y—I’m too busy worrying about how the geese might start an uprising soon.",
  "Sorry, eh—I was just about to agree, but then a moose ate my calendar, and now I don’t know what day it is.",
  "My bad, eh—I’m already committed to a date with my couch and a hot cup of Tim’s tea.",
  "Sorry ‘bout dat—I had every intention of helping, but I just got stuck in a group chat with my cousins.",
  "My bad, eh—I’m not sure if I’m more sorry for saying no or for what’s happening with the weather right now.",
  "Sorry, b’y—I had plans, but I got distracted by a mystery moose situation in my backyard.",
  "My bad, eh—I can’t come, I’m busy trying to figure out why all the geese left the country for the winter.",
  "Sorry ‘bout dat, eh—I’m stuck in a very serious discussion about which Tim Hortons is the best in town.",
  "My bad, eh—I’m sorry, but I’ve got a personal commitment to my blanket fort right now.",
  "Sorry, b’y—I can’t make it; I’ve been shovelling snow for the last three hours and I’m a little frozen.",
  "My bad, eh—I promised my neighbour I wouldn’t leave the house until the snow melts (don’t ask).",
  "Sorry, eh—I’ve got to go help my buddy track down his missing hockey puck from last season.",
  "My bad, b’y—I’d love to, but I’m busy negotiating a peace treaty with the raccoons in my attic.",
  "Sorry ‘bout dat, eh—I said yes last week, but then I got into a very deep conversation about poutine and now I’m too full.",
  "My bad, eh—I planned on saying yes, but then I slipped on a frozen butter tart and now I’m contemplating life.",
  "Sorry, b’y—I can’t commit right now, I’m dealing with an ongoing dispute over who makes the best Caesar.",
  "My bad, eh—I tried to help, but a snowplow got in the way, and now I’m stuck behind it.",
  "Sorry ‘bout dat—I’ve been up all night watching the weather, and now I’ve got no energy to help.",
  "My bad, eh—I promised my aunt I’d stay in today, and she’s got my whole day planned out.",
  "Sorry, eh—I’d say yes, but I’m waiting for my Tim Hortons order to arrive, and it’s already 20 minutes late.",
  "My bad, b’y—I’ve got to go fix my TV before it starts showing replays of last season’s hockey fights again.",
  "Sorry, eh—I was gonna say yes, but the moose just knocked over my garbage can and now I’m cleaning up.",
  "My bad, eh—I can’t help, my snowmobile’s in the shop, and I’m feeling a little out of sorts, eh.",
  "Sorry ‘bout dat—I meant to help, but I’m busy dealing with a minor goose-related incident.",
  "My bad, eh—I was gonna come by, but then I got caught in a very serious debate about poutine toppings.",
  "Sorry, b’y—I’d love to, but my Tim Hortons loyalty card has expired and I’m dealing with the consequences.",
  "My bad, eh—I meant to say yes, but I’m emotionally drained from an afternoon of maple syrup tasting.",
  "Sorry ‘bout dat—I’ve got a commitment to watching my neighbour’s driveway get plowed.",
  "My bad, eh—I can’t help, I’ve got to go deal with an important situation: a moose in my garage.",
  "Sorry, eh—I’ve got a very serious discussion going on about how cold is too cold to leave the house.",
  "My bad, eh—I would, but there’s a goose in my driveway, and I’m not sure what to do about it.",
  "Sorry, b’y—I planned on helping, but then I got distracted by a snowball fight with a neighbour’s kid.",
  "My bad, eh—I’d love to, but my hockey stick needs repairs before I’m available to do anything.",
  "Sorry ‘bout dat, eh—I’d help, but my driveway is currently under the jurisdiction of my snow shovel.",
  "My bad, eh—I’m in the middle of writing a strongly worded letter to the weather service.",
  "Sorry, b’y—I planned on joining, but then I realized my curling skills aren’t up to par today.",
  "My bad, eh—I would, but the maple syrup is calling, and I’ve got priorities, eh?",
  "Sorry ‘bout dat, b’y—I got trapped inside a snowbank and I can’t dig myself out yet.",
  "My bad, eh—I was gonna say yes, but I’m negotiating with the moose about the boundaries of my yard.",
  "Here’s another 60, keeping it fresh and fully Canadian! Want me to keep the momentum going or adjust anything as you move forward with your project, eh?",
  "My bad, eh—I’d help, but I’m busy trying to figure out how to get the maple syrup out of my beard.",
  "Sorry ‘bout dat, b’y—I was just about to say yes, but I realized I left my toque at Tim Hortons, and it’s a whole thing.",
  "My bad, eh—I would, but I’m stuck in traffic behind a truck full of snow and questionable cheese.",
  "Sorry, b’y—I’d love to, but I’ve been assigned to a very important geese-watching mission.",
  "My bad, eh—I’m too busy trying to teach my cat how to play hockey; it's a lot harder than it sounds.",
  "Sorry ‘bout dat, eh—I was going to help, but then I got distracted by a heated argument over who’s got the best poutine in town.",
  "My bad, b’y—I’ve got a very important meeting with my couch and a cup of Tim Hortons coffee.",
  "Sorry, eh—I’d say yes, but I’ve got a moose outside my door that insists on making a snowman.",
  "My bad, eh—I would, but I’m locked in a battle with my neighbour’s snowblower, and it’s not going well.",
  "Sorry, b’y—I tried to help, but then I had to go check if my sled dog was still barking at the wind.",
  "My bad, eh—I’m in the middle of something important: finding my other mitten.",
  "Sorry ‘bout dat, eh—I’d come, but I’m on a strict schedule of not leaving the house when the snow is this deep.",
  "My bad, b’y—I’d help, but I can’t do anything while my snowmobile is still in the shop.",
  "Sorry, eh—I meant to say yes, but then I remembered I’m allergic to commitments.",
  "My bad, eh—I’d love to assist, but I’m waiting for a very important delivery of butter tarts.",
  "Sorry ‘bout dat, b’y—I was gonna help, but I just got distracted by a raccoon in my backyard eating a bag of chips.",
  "My bad, eh—I’d love to, but I’m busy trying to convince my cat that he can’t come with me to Tim Hortons.",
  "Sorry, eh—I would, but I’ve got a meeting with a moose in the backyard and I can’t cancel that.",
  "My bad, b’y—I’d come, but I’m waiting for the ice to thaw so I can find my car.",
  "Sorry ‘bout dat, eh—I’d be there, but I’m busy dealing with an emotional support geese situation.",
  "My bad, eh—I’d love to help, but I’ve got a snowball fight to settle with my neighbour’s kids.",
  "Sorry, b’y—I was going to agree, but then I realized I haven’t had my double-double today, and I can’t make decisions without it.",
  "My bad, eh—I’d help, but my toque’s got a mind of its own, and it keeps falling off in the wind.",
  "Sorry ‘bout dat—I was gonna help, but I’ve been locked in a heated debate about the proper way to eat a butter tart.",
  "My bad, eh—I’d love to, but I’ve got a personal commitment to helping my neighbour shovel out his driveway.",
  "Sorry, b’y—I can’t come, I’m too busy trying to teach my moose how to play fetch.",
  "My bad, eh—I’d love to, but I’m currently in the middle of an intense game of curling on my living room floor.",
  "Sorry, eh—I meant to help, but I got distracted by a hockey game, and now I’m emotionally invested.",
  "My bad, eh—I’d love to say yes, but I’m about to face off with a snowdrift the size of Newfoundland.",
  "Sorry, b’y—I was gonna help, but then I noticed my neighbor’s igloo is a bit crooked and I’m fixing that instead.",
  "My bad, eh—I’d love to, but I’ve got to spend the afternoon staring at my maple tree, just to make sure it’s still Canadian enough.",
  "Sorry ‘bout dat, eh—I can’t come, I’ve got to feed the geese in my yard—they’re getting a little demanding.",
  "My bad, eh—I’d help, but I’m too busy teaching my dog how to say “sorry.”",
  "Sorry, b’y—I’d love to, but I’ve got to finish fixing my hockey stick before I do anything else.",
  "My bad, eh—I can’t right now, I’m stuck trying to figure out how to unfreeze my car doors.",
  "Sorry ‘bout dat, eh—I was gonna help, but I’ve got an emergency meeting with my snow shovel.",
  "My bad, b’y—I’d say yes, but I’ve got a promise to keep to my Tim Hortons loyalty card.",
  "Sorry, eh—I’d help, but there’s a moose in my driveway, and I’m not even sure if he’s Canadian.",
  "My bad, eh—I would, but I’ve got a geese-related crisis on my hands that’s taking priority.",
  "Sorry ‘bout dat, b’y—I’d be there, but I’ve got to catch up on an important game of snowball tag with my cousin.",
  "My bad, eh—I would, but my neighbour’s sled is stuck in the snow, and I’ve got to help with that.",
  "Sorry ‘bout dat, b’y—I’d love to, but I’m trying to figure out if my Tim Hortons cup is a “proper” size.",
  "My bad, eh—I can’t come right now, I’m in the middle of an intense debate about which is superior: poutine or butter tarts.",
  "Sorry, b’y—I’d help, but I’ve got to wrestle with my car door that’s frozen shut. It’s a whole thing.",
  "My bad, eh—I’d love to, but I’m busy shovelling my driveway and trying to not be swallowed by the snowbanks.",
  "Sorry ‘bout dat, eh—I’d love to, but I’ve got a very important meeting with my favorite Tim Hortons worker.",
  "My bad, b’y—I was going to say yes, but then I remembered I left my skates at the rink.",
  "Sorry, eh—I’d come, but I can’t find my toque, and it’s a whole ordeal.",
  "My bad, eh—I’d love to, but I’m trying to convince the moose in my backyard to leave.",
  "Sorry, b’y—I meant to help, but I’ve got an emergency: my hockey stick broke, and I can’t let that slide.",
  "My bad, eh—I’d love to, but I’m dealing with an ongoing issue involving a snowball fight and a heated rivalry.",
  "Sorry ‘bout dat, b’y—I’d love to, but I’m waiting for my neighbour to stop yelling at the geese in his yard.",
  "My bad, eh—I can’t right now, I’m busy avoiding a frozen pipe disaster at my cabin.",
  "Sorry, b’y—I’d help, but I’m trying to get my dog to stop chasing the geese, and it’s not going well.",
  "My bad, eh—I was going to say yes, but I realized my parka needs re-zippering, and I can’t commit to anything while that’s happening.",
  "Sorry, eh—I’d love to, but I’ve got a meeting with a raccoon who keeps breaking into my shed.",
  "My bad, b’y—I can’t right now, I’m in the middle of a heated curling match with my buddy.",
  "Sorry, eh—I’d love to, but I’m busy organizing my collection of hockey cards—priorities, eh?",
  "My bad, eh—I was going to help, but I just remembered I have a 2-hour snowshoe hike planned. Very important stuff.",
  "Sorry ‘bout dat, b’y—I can’t right now, I’m struggling to get my ice skates sharpened.",
  "My bad, eh—I’d love to help, but I’m too busy staring at the snowflakes, pondering life’s great mysteries.",
  "Sorry, b’y—I can’t come, I’ve got a moose in my garage that’s trying to build a snow fort.",
  "My bad, eh—I would, but my dog has decided he’s now in charge of the neighborhood watch program.",
  "Sorry, eh—I’d love to, but I’m stuck fixing my snowmobile, which seems to think it’s a summer vehicle.",
  "My bad, eh—I was going to help, but I’m too busy figuring out if my snow boots are still waterproof.",
  "Sorry ‘bout dat, b’y—I’d love to help, but I’m currently rewatching every Canadian hockey game from the ’90s.",
  "My bad, eh—I’d love to, but I’m in the middle of a very intense battle with a winter storm and a set of frozen gutters.",
  "Sorry, b’y—I’d help, but my neighbour’s Christmas lights are still up, and I’m trying to be a good Canadian and take them down.",
  "My bad, eh—I’d love to, but I’m too busy helping my buddy’s moose train for the winter Olympics.",
  "Sorry, eh—I was gonna help, but I’m trying to figure out the perfect temperature for a cup of hot chocolate.",
  "My bad, b’y—I can’t right now, I’m trying to train my goose to stop breaking into my kitchen.",
  "Sorry ‘bout dat, eh—I’d help, but I’ve got to go give my snow blower a pep talk.",
  "My bad, eh—I’d love to, but I’m busy trying to untangle my Christmas lights from last year. The struggle is real.",
  "Sorry, b’y—I meant to help, but I’m in the middle of making the perfect snow angel. It’s an art form, eh?",
  "My bad, eh—I’d love to, but I’m waiting for my hot chocolate to cool down. Can’t rush perfection, b’y.",
  "Sorry, eh—I can’t right now, I’m busy doing my best to stop my dog from eating all the snow.",
  "My bad, b’y—I’d love to, but I’ve got to rescue my Tim Hortons cup from the snowdrift it’s currently trapped in.",
  "Sorry, eh—I’d love to, but I’m dealing with a very serious situation: I dropped my mittens in the snow, and now I can’t find them.",
  "My bad, eh—I’d help, but I’m about to shovel my driveway, and that’s gonna take a solid few hours.",
  "Sorry, b’y—I was gonna help, but I’m trying to convince my moose to leave my backyard. It’s a tough negotiation.",
  "My bad, eh—I’d help, but I’m busy trying to figure out if my igloo is structurally sound for the upcoming snowstorm.",
  "Sorry ‘bout dat, b’y—I can’t right now, I’m in the middle of cooking a batch of maple syrup, and it’s a delicate process.",
  "My bad, eh—I’d love to, but I’m on moose-watch duty—there’s a big one in my backyard, and I can’t leave my post.",
  "Sorry, b’y—I’d help, but I’m dealing with the great Canadian debate: to wear a toque or not to wear a toque.",
  "My bad, eh—I was gonna help, but I’m busy trying to get my sled to start. It’s stubborn, like a real Canadian winter.",
  "Sorry, eh—I’d love to, but I’m dealing with a family emergency. My pet goose just ate my hockey stick, b’y.",
  "My bad, b’y—I’d help, but I’m negotiating with my snowplow to get the driveway clear. It’s a slow process.",
  "Sorry, eh—I’d love to, but I’m currently making the perfect poutine, and you just can’t rush that, eh?",
  "My bad, eh—I’d love to, but I’m busy trying to stop the geese from attacking my garden. They’re very territorial.",
  "Sorry, b’y—I can’t help right now, I’m in the middle of a very important Tim Hortons run. The double-double calls.",
  "My bad, eh—I’d help, but I’m busy trying to convince the ice rink to let me in. It’s a tough crowd, eh?",
  "Sorry, eh—I can’t right now, I’m dealing with a frozen door. Seems like it’s going to take all of Newfoundland to open it.",
  "My bad, eh—I’d love to, but I’m currently in the middle of a heated debate about which hockey team is the best.",
  "Sorry, b’y—I can’t help, I’ve got to go apologize to my snow shovel. It’s been giving me attitude lately.",
  "My bad, eh—I’d love to, but I’m busy watching the Canadian geese lead a protest in my front yard.",
  "Sorry, eh—I can’t help right now, I’m busy fixing my snowmobile. It broke down again, eh?",
  "My bad, b’y—I’d love to, but I’ve got to go find my car. It’s buried somewhere under all this snow.",
  "Sorry, eh—I’d help, but I’m in the middle of a very important conversation with my neighbour about the weather. It’s serious stuff.",
  "My bad, eh—I can’t right now, I’m busy trying to get my dog to stop barking at the squirrels. They’re driving me nuts, b’y.",
  "Sorry, b’y—I’d love to, but I’m busy fixing the roof after the last snowstorm. It’s a real winter wonderland problem.",
  "My bad, eh—I’d help, but I’m dealing with a very serious situation. The maple syrup is running out, b’y!",
  "Sorry, eh—I can’t help, I’ve got a very important meeting with my hot chocolate mug. It’s been giving me the cold shoulder lately.",
  "My bad, eh—I’d love to, but I’ve got to go help my neighbour shovel his driveway. It’s the neighbourly thing to do, eh?",
  "Sorry, b’y—I can’t right now, I’m in the middle of a deep conversation with my dog about the geese in the park.",
  "My bad, eh—I’d love to, but I’m about to go on a snowshoe trek, and I’m not sure when I’ll be back.",
  "Sorry, eh—I can’t help, I’m busy explaining to my dog why we can’t chase the snowplow. He’s very disappointed, b’y.",
  "My bad, eh—I’d love to help, but I’m busy getting my car unstuck from the snowbank. It’s a full-time job, eh?",
  "Sorry, b’y—I’d love to, but I’m in the middle of teaching my goose how to properly honk. It’s a tough skill to master.",
  "My bad, eh—I can’t right now, I’ve got a very important job of supervising the snow clearing in my neighbourhood.",
  "Sorry, eh—I’d help, but I’m in the middle of making sure my mittens match my toque. It’s a fashion emergency.",
  "My bad, eh—I’d love to, but I’m busy dealing with an existential crisis involving my snow blower. It’s not cooperating.",
  "Sorry, b’y—I can’t help, I’ve got to go rescue my snow shovel from the snowdrift it got stuck in.",
  "My bad, eh—I’d love to, but I’m in the middle of trying to locate my lost hockey puck. It’s somewhere in the snow.",
  "Sorry, eh—I can’t right now, I’m busy avoiding the aggressive squirrels that are trying to steal my lunch.",
  "My bad, eh—I’d love to, but I’m in the middle of an intense game of street hockey. Can’t leave my team hanging, b’y.",
  "Sorry, b’y—I can’t help, I’ve got to go talk to the moose that’s currently trying to steal my bird feeder.",
  "My bad, eh—I’d love to, but I’m stuck in a conversation with my neighbour about which is better: snowstorms or freezing rain.",
  "Sorry, eh—I can’t right now, I’m busy trying to make my car start. It’s not liking the cold weather, b’y.",
  "My bad, eh—I’d love to help, but I’m busy convincing my dog that he does not need to chase every snowplow.",
  "Sorry, b’y—I can’t help, I’ve got to go take care of my ice rink. It needs some serious TLC after this last thaw.",
  "My bad, eh—I’d love to help, but I’ve got to go find my skates. There’s a hockey game in the driveway that’s not going to play itself.",
  "Sorry, b’y—I can’t right now, I’m busy keeping the geese out of my backyard. They’re causing a ruckus again.",
  "My bad, eh—I’d love to, but I’m dealing with a snowstorm that’s messing with my Wi-Fi. Priorities, eh?",
  "Sorry, eh—I can’t help, I’m in the middle of teaching my cat how to shovel. It’s a slow process.",
  "My bad, eh—I’d love to, but I’ve got to go check the maple syrup taps. It’s a full-time job, b’y.",
  "Sorry, b’y—I can’t right now, I’m busy arguing with my neighbour about whether poutine should have gravy or not. It’s an ongoing debate.",
  "My bad, eh—I’d love to help, but I’m busy making sure my snowmobile doesn’t freeze solid.",
  "Sorry, eh—I can’t help, I’m in the middle of a critical meeting with my Tim Hortons cup. It’s a matter of national importance.",
  "My bad, eh—I’d love to, but I’m trying to figure out how to make my snowman more symmetrical. It’s a challenge.",
  "Sorry, b’y—I can’t right now, I’m busy teaching my dog how to appreciate a good snowstorm. It’s a work in progress.",
  "My bad, eh—I’d love to, but I’ve got to go shovel my driveway for the third time today. It’s a never-ending battle with winter, eh?",
  "Sorry, b’y—I can’t help, I’m in the middle of a very important discussion about the best way to prepare a butter tart.",
  "My bad, eh—I’d love to help, but I’m busy trying to locate my lost toque. It’s somewhere under this snow pile.",
  "Sorry, eh—I can’t help, I’m trying to convince my moose to stop eating my garden. It’s a delicate negotiation.",
  "My bad, b’y—I’d love to, but I’m busy making sure my snowshoes aren’t too tight. It’s harder than it looks.",
  "Sorry, eh—I can’t help, I’ve got a very important appointment with my igloo. I need to check if it’s still standing after the last thaw.",
  "My bad, eh—I’d love to help, but I’ve got to go rescue my hockey net from the wind. It’s been rolling down the street all afternoon.",
  "Sorry, b’y—I can’t right now, I’m busy making sure the geese are behaving themselves. It’s a full-time job.",
  "My bad, eh—I’d love to, but I’ve got to go make sure the squirrels aren’t taking over my porch. They’re sneaky little things.",
  "Sorry, eh—I can’t help, I’m busy keeping track of the snowbanks. They’re getting a little too high for comfort.",
  "My bad, b’y—I’d love to help, but I’m busy convincing my dog that snowflakes are not for eating.",
  "Sorry, eh—I can’t help, I’m busy trying to figure out how to keep my Tim Hortons cup warm in this weather.",
  "My bad, eh—I’d love to help, but I’m busy ensuring the moose in my backyard doesn’t break anything.",
  "Sorry, b’y—I can’t right now, I’m in the middle of a very heated argument with my neighbour about the proper way to say “sorry.”",
  "My bad, eh—I’d love to, but I’m in the middle of rescuing my scarf from the wind. It’s a very dramatic situation.",
  "Sorry, b’y—I can’t help, I’ve got a very important job: making sure the weather doesn’t mess with my plans for the day.",
  "My bad, eh—I’d love to help, but I’m busy figuring out how to keep my ice rink from melting. It’s a battle, b’y.",
  "Sorry, eh—I can’t right now, I’m busy making sure my mittens are the right size. It’s critical, eh?",
  "My bad, b’y—I’d love to, but I’ve got to go deal with the snowplow blocking my driveway. It’s a serious issue.",
  "Sorry, eh—I can’t help, I’m in the middle of a crucial decision: which hockey game to watch. It’s a tough choice, eh?",
  "My bad, eh—I’d love to help, but I’m busy convincing the moose that it’s not his turn to shovel the driveway.",
  "Sorry, b’y—I can’t help, I’m busy trying to get my snowshoes unstuck from the snowbank. It’s a mess out here.",
  "My bad, eh—I’d love to, but I’ve got to go check on my maple syrup. It’s been bubbling for a while, and I don’t want to burn it.",
  "Sorry, b’y—I can’t right now, I’m busy trying to keep the geese from stealing my Tim Hortons cup. It’s an ongoing struggle.",
  "My bad, eh—I’d love to, but I’m busy making sure my snowmobile doesn’t get stuck in the snowdrift again.",
  "Sorry, eh—I can’t help, I’m in the middle of making sure my car’s engine doesn’t freeze. It’s a real problem, eh?",
  "My bad, eh—I’d love to help, but I’m in the middle of an intense game of street hockey. Can’t leave my team hanging, b’y.",
  "Sorry, b’y—I can’t help, I’ve got to go save my snowshovel from the wind. It’s blowing away again.",
  "My bad, eh—I’d love to help, but I’m in the middle of planning my next ice fishing trip. Gotta make sure I’ve got everything I need.",
  "Sorry, eh—I can’t right now, I’m busy making sure the ice rink doesn’t crack under the pressure. It’s a delicate operation.",
  "My bad, eh—I’d love to, but I’m busy making sure my snow blower doesn’t freeze up. It’s been a bit temperamental, b’y.",
  "Sorry, b’y—I can’t help, I’ve got a very important job: making sure my Tim Hortons loyalty card is still intact.",
  "My bad, eh—I’d love to help, but I’m busy cleaning up after the moose that decided to wander into my garage.",
  "Sorry, b’y—I can’t right now, I’m busy trying to figure out how to make my mittens warmer. It’s a real issue, eh?",
  "My bad, eh—I’d love to help, but I’m in the middle of trying to keep the ice from melting in my backyard rink.",
  "Sorry, eh—I can’t help, I’m busy making sure the squirrels don’t steal my lunch again. They’re a crafty bunch.",
  "My bad, eh—I’d love to help, but I’m in the middle of trying to convince the geese to stop fighting on my lawn.",
  "Sorry, b’y—I can’t help, I’ve got to go rescue my snowblower from the snow drift it got stuck in.",
  "My bad, eh—I’d love to help, but I’m busy trying to fix my shovel. The cold weather’s really doing a number on it, eh?",
  "Sorry, eh—I can’t right now, I’m busy making sure my car doesn’t get buried under this new layer of snow.",
  "Sorry, b’y, I’d love to help, but it’s too hot out here. My car’s air conditioning is about as effective as a snowman in July.",
  "My bad, eh—I’d love to, but the humidity has my hair looking like a pile of wet laundry, and I need to fix that first.",
  "Sorry, eh—I can’t right now, it’s so hot I’m pretty sure my lawn’s trying to turn into a desert. Gotta go water it for the hundredth time.",
  "My bad, eh—I’d love to help, but the salt on the roads ate through my car’s undercarriage. I’m mostly driving rust these days.",
  "Sorry, b’y, I can’t right now—I’m busy trying to figure out how to fix my air conditioner. It’s like trying to play hockey with no skates.",
  "My bad, eh—I’d love to, but it’s so hot I’m melting faster than a popsicle on a dock in Newfoundland, b’y.",
  "Sorry, eh—I can’t help, I’m busy washing the salt off my car. It’s like the Atlantic provinces had a personal vendetta against my vehicle this winter.",
  "My bad, b’y—I’d love to help, but it’s so humid out, even my sunglasses are fogging up. Gotta get them clear first, eh?",
  "Sorry, b’y, I can’t right now—I’ve got to go hide from the heat. My air conditioning’s broken, and I’m just trying not to turn into a puddle.",
  "My bad, eh—I’d love to, but it’s so hot out, I’m pretty sure my lawn is about to catch fire. Gotta go water it, eh?",
  "Sorry, eh—I can’t help, I’m busy trying to keep my car from rusting further. Between the salt and the heat, I’m almost driving a vintage model now.",
  "My bad, eh—I’d love to help, but it’s too hot to even think straight. I’m pretty sure I’m getting sunstroke just standing here.",
  "Sorry, b’y, I can’t help—I’m in the middle of cooling down my barbecue. I swear, I’ve got more problems than a winter storm at a cottage.",
  "My bad, eh—I’d love to, but the humidity is making everything sticky. Even my ice cream is sweating, b’y.",
  "Sorry, eh—I can’t right now, I’m dealing with a heatwave. It’s so hot, I’m pretty sure the moose have started asking for iced tea.",
  "My bad, eh—I’d love to help, but I’m busy scraping salt off my car. It’s like the salt wants to make sure my car is only held together by rust.",
  "Sorry, b’y—I can’t right now, I’m making sure my iced coffee doesn’t melt in this heat. It’s a serious job, eh?",
  "My bad, eh—I’d love to, but it’s so hot, my driveway’s becoming a parking lot for puddles. I’ve got to move my car before it starts floating.",
  "Sorry, eh—I can’t help, I’m busy trying to get the AC in my house working. Right now, it’s just blowing hot air—more like a summer day in Ontario.",
  "My bad, b’y—I’d love to help, but I’m currently fighting with my lawnmower. It refuses to start in this heat.",
  "Sorry, eh—I can’t help, I’m busy scraping off the salt on my car. Between winter and summer, it looks like it’s been to both the Arctic and Sahara.",
  "My bad, eh—I’d love to help, but my lawn looks like the tundra. This heat’s got everything turning crispy.",
  "Sorry, b’y—I can’t right now, I’m busy tracking down where the AC leaked. I’m practically melting in my own house.",
  "My bad, eh—I’d love to help, but it’s so hot, I’m pretty sure even the mosquitoes are asking for a break.",
  "Sorry, b’y—I can’t help, I’m trying to cool off with an ice pack. It’s so hot, I think I’m going to turn into a puddle.",
  "My bad, eh—I’d love to, but I’ve got to go find my sunglasses. It’s bright out here, and I’m not about to get blinded by the sun.",
  "Sorry, b’y—I can’t help, I’ve got a whole other mess: my car’s practically made of rust from the salt. It’s more salt than car now.",
  "My bad, eh—I’d love to, but I’m in the middle of battling my backyard. The mosquitoes have claimed it as their territory.",
  "Sorry, eh—I can’t right now, I’m busy dealing with a heatwave. It’s so hot, I’m considering just moving to the North Pole.",
  "My bad, eh—I’d love to help, but I’m busy fighting the humidity. It’s making everything feel like a sauna out here.",
  "Sorry, b’y—I can’t help, I’m currently navigating a parking lot that’s melting in the heat. No time for anything else right now.",
  "My bad, eh—I’d love to help, but I’ve got to go grab an ice-cold drink before I overheat. It’s a matter of survival, eh?",
  "Sorry, b’y—I can’t help, I’m busy making sure my car doesn’t turn into a rusty disaster from all this road salt. Can’t deal with more car problems right now.",
  "My bad, eh—I’d love to help, but I’m in the middle of a very important discussion with my fan. It’s working overtime to keep me cool.",
  "Sorry, eh—I can’t help, I’m busy trying to keep my iced tea from turning into a puddle in this heat. It’s no easy task, b’y.",
  "My bad, eh—I’d love to help, but I’ve got to go deal with my roof. The heat’s making it expand and contract, and it’s starting to make some weird noises.",
  "Sorry, b’y—I can’t help right now, I’m too busy keeping my car from turning into a rust bucket. All that salt, eh? It’s a real pain.",
  "My bad, eh—I’d love to, but I’m busy checking on my backyard garden. It’s so hot, the tomatoes are looking at me like they’ve had enough.",
  "Sorry, eh—I can’t help, I’m busy trying to cool down. It’s so humid, I’m pretty sure I’m living in a cloud right now.",
  "My bad, eh—I’d love to help, but it’s so hot, I’m pretty sure the pavement is turning into a frying pan. Gotta keep moving, b’y.",
  "Sorry, b’y—I can’t help right now, I’m busy making sure my air conditioner doesn’t give up. It’s already working overtime with this heat.",
  "My bad, eh—I’d love to, but the heat’s so intense, I’m about to start a fire just to roast marshmallows, eh? Can’t focus on anything else.",
  "Sorry, eh—I can’t right now, I’m busy watering my plants. It’s so dry, I feel like I’m in a desert, b’y.",
  "My bad, eh—I’d love to help, but I’m currently fighting with the humidity. It’s like trying to swim through the air, b’y.",
  "Sorry, b’y—I can’t help, I’m busy dealing with a power outage. The heat’s got the whole town on edge, and I’m trying to cool down any way I can.",
  "My bad, eh—I’d love to help, but I’m busy cleaning salt off my car. The Atlantic provinces really took their toll this year.",
  "Sorry, eh—I can’t help, I’ve got to go see if the road salt has eaten through my brake lines. I don’t trust it at all anymore.",
  "My bad, eh—I’d love to, but it’s too hot, and I’ve got a heatstroke brewing. I’ll need some ice and a cold drink first.",
  "Sorry, b’y—I can’t help right now, I’m dealing with a very sticky situation. I’m covered in sweat, and it’s just not the time for anything else.",
  "My bad, eh—I’d love to, but I’m in the middle of tracking down my missing umbrella. The rain was so sudden, and now the heat’s killing me."
]
